In [1]:
import pandas as pd
df =pd.read_csv("insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [2]:
df.shape

(1338, 7)

In [3]:
df.isna().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

# Encoding with replace function

In [4]:
df.sex.unique()

array(['female', 'male'], dtype=object)

In [5]:
df.sex = df.sex.replace(["female", "male"],[1,0])

In [6]:
df.smoker.unique()

array(['yes', 'no'], dtype=object)

In [7]:
df.smoker = df.smoker.replace(['yes','no'],[0,1])

In [8]:
df.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [9]:
df.region = df.region.replace(['southwest','southeast','northwest',"northeast"],[0,1,2,3])

In [10]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    1  27.900         0       0       0  16884.92400
1   18    0  33.770         1       1       1   1725.55230
2   28    0  33.000         3       1       1   4449.46200
3   33    0  22.705         0       1       2  21984.47061
4   32    0  28.880         0       1       2   3866.85520

# MinMaxScaling on other column

In [11]:
from sklearn.preprocessing import MinMaxScaler

In [12]:
M = MinMaxScaler()

In [13]:
df.age = M.fit_transform(df[['age']])
df.bmi =M.fit_transform(df[['bmi']])

In [14]:
df.head()

        age  sex       bmi  children  smoker  region      charges
0  0.021739    1  0.321227         0       0       0  16884.92400
1  0.000000    0  0.479150         1       1       1   1725.55230
2  0.217391    0  0.458434         3       1       1   4449.46200
3  0.326087    0  0.181464         0       1       2  21984.47061
4  0.304348    0  0.347592         0       1       2   3866.85520

# Label Encoding

In [15]:
import pandas as pd
df = pd.read_csv("insurance.csv")

In [16]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
L = LabelEncoder()

In [19]:
df.sex = L.fit_transform(df[["sex"]])

C:\Users\Binu\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

In [20]:
df.smoker = L.fit_transform(df[["smoker"]])

In [21]:
df.region = L.fit_transform(df[["region"]])

In [22]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# Standardization other column

In [23]:
from sklearn.preprocessing import StandardScaler

In [24]:
S = StandardScaler()

In [25]:
df.age = S.fit_transform(df[["age"]])

In [26]:
df.bmi = S.fit_transform(df[["bmi"]])

In [27]:
df.head()

        age  sex       bmi  children  smoker  region      charges
0 -1.438764    0 -0.453320         0       1       3  16884.92400
1 -1.509965    1  0.509621         1       0       2   1725.55230
2 -0.797954    1  0.383307         3       0       2   4449.46200
3 -0.441948    1 -1.305531         0       0       1  21984.47061
4 -0.513149    1 -0.292556         0       0       1   3866.85520

# One Hot Encoding

In [38]:
import pandas as pd
df =pd.read_csv("insurance.csv")

In [39]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [42]:
new_sex =pd.get_dummies(df["sex"])

In [44]:
new_smoker = pd.get_dummies(df["smoker"])

In [46]:
new_region = pd.get_dummies(df["region"])

In [47]:
df = df.drop('sex', axis=1)

In [49]:
df = df.drop('smoker',axis=1)

In [50]:
df= df.drop('region', axis=1)

In [57]:
df = pd.concat([df,new_sex,new_smoker,new_region], axis=1)

In [59]:
df = df.drop("northeast" , axis=1)

In [61]:
df.head()

,age,bmi,children,charges,female,male,female,male,no,yes,northwest,southeast,southwest
0,19,27.900,0,16884.92400,1,0,1,0,0,1,0,0,1
1,18,33.770,1,1725.55230,0,1,0,1,1,0,0,1,0
2,28,33.000,3,4449.46200,0,1,0,1,1,0,0,1,0
3,33,22.705,0,21984.47061,0,1,0,1,1,0,1,0,0
4,32,28.880,0,3866.85520,0,1,0,1,1,0,1,0,0

In [62]:
from sklearn.preprocessing import MaxAbsScaler

In [63]:
MAS = MaxAbsScaler()

In [64]:
df.age = MAS.fit_transform(df[["age"]])

C:\Users\Binu\anaconda3\lib\site-packages\pandas\core\generic.py:5494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [65]:
df.bmi = MAS.fit_transform(df[["bmi"]])

C:\Users\Binu\anaconda3\lib\site-packages\pandas\core\generic.py:5494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [36]:
df.head()

        age     sex       bmi  children smoker     region      charges
0  0.296875  female  0.525127         0    yes  southwest  16884.92400
1  0.281250    male  0.635611         1     no  southeast   1725.55230
2  0.437500    male  0.621118         3     no  southeast   4449.46200
3  0.515625    male  0.427348         0     no  northwest  21984.47061
4  0.500000    male  0.543572         0     no  northwest   3866.85520

# Ordinal Encoding

In [106]:
import pandas as pd
df = pd.read_csv("insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [117]:
df.sex.unique()
df.smoker.unique()
df.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [108]:
sex2 = ["female",'male']
smoker2 =["yes","no"]

In [109]:
from sklearn.preprocessing import OrdinalEncoder

In [110]:
Oren = OrdinalEncoder(categories =[sex2])

In [111]:
df.sex = Oren.fit_transform(df[["sex"]])

In [114]:
Oren2= OrdinalEncoder(categories=[smoker2])

In [115]:
df.smoker = Oren2.fit_transform(df[["smoker"]])

In [118]:
region2 =['southwest', 'southeast', 'northwest', 'northeast']

In [119]:
Oren3 = OrdinalEncoder(categories=[region2])

In [120]:
df.region = Oren3.fit_transform(df[["region"]])

In [121]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520